Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
        # (23 unchanged attributes hidden)

      - tag {
          - key                 = "Env" -> null
          - propagate_at_launch = false -> null
          - value               = "teste" -> null
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
        # (23 unchanged attributes hidden)

      + tag {
          + key                 = "Env"
          + propagate_at_launch = false
          + value               = "teste"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be destroyed
  # (because aws_lb_listener.front_end is not in configuration)
- resource "aws_lb_listener" "front_end" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-2:398963803929:listener/app/lb-ecs/1ba5a14d83255d1b/eca30d51e0f93cf6" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-2:398963803929:listener/app/lb-ecs/1ba5a14d83255d1b/eca30d51e0f93cf6" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_target_group.tg_ecs must be replaced
-/+ resource "aws_lb_target_group" "tg_ecs" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tg-ecs/8248864adeb13723" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "tg-ecs"
      ~ port                               = 80 -> 4141 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
